---
type: IFCFileReadOptions
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 5
tags: [revit-api, class]
---

# IFCFileReadOptions

`Autodesk.Revit.DB.IFC.IFCFileReadOptions` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IFCFileReadOptions | 2014 | `public IFCFileReadOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | FileName | 2014 | `public string FileName { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | XMLConfigFileName | 2014 | `public string XMLConfigFileName { get ; set ; }` |